// import data from "./data.json"

const button = document.getElementById('button')
const word = document.getElementById('word')
const input = document.getElementById('input')
const positive = document.getElementById('positive');
const negative = document.getElementById('negative');
const refreshButton = document.getElementById('refresh')
const answer = document.getElementById('answer')

// must be storaged in the local state
let positiveCounter = 0;
let negativeCounter = 0;
let words;
let currentWordIndex;
// ___
let wordElem = null // word for user span/div reference

// must be once done before loading page
words = [
    ["Алфавіт", "алфАвіт"],
    ["Аркушик", "Аркушик"],
    ["Асиметрія", "асиметрІя"],
    ["Багаторазовий", "багаторазОвий"],
    ["Безпринципний", "безпринцИпний"],
    ["Бешкет", "бЕшкет"],
    ["Благовіст", "блАговіст"],
    ["Близький", "близькИй"],
    ["Болотистий", "болотИстий"],
    ["Бородавка", "борОдавка"],
    ["Босоніж", "босОніж"],
    ["Боязнь", "боЯзнь"],
    ["Бурштиновий", "бурштинОвий"],
    ["Бюлетень", "бюлетЕнь"],
    ["Ваги (у мн.)", "вАги"],
    ["Вантажівка", "вантажІвка"],
    ["Весняний", "веснЯнИй"],
    ["Вигода (користь)", "вИгода"],
    ["Вигода (зручність)", "вигОда"],
    ["Видання", "видАння"],
    ["Визвольний", "визвОльний"],
    ["Вимога", "вимОга"],
    ["Випадок", "вИпадок"],
    ["Виразний", "вирАзний"],
    ["Висіти", "вИсіти"],
    ["Витрата", "вИтрата"],
    ["Вишиваний", "вишИваний"],
    ["Відвезти", "відвезтИ"],
    ["Відвести", "відвестИ"],
    ["Відгомін", "вІдгомін"],
    ["Віднести", "віднестИ"],
    ["Відомість (список)", "вІдомість"],
    ["Відомість (повідомлення, дані, популярність)", "відОмість"],
    ["Вірші", "вІрші"],
    ["Віршовий", "віршовИй"],
    ["Вітчим", "вітчИм"],
    ["Гальмо", "гальмО"],
    ["Гальма", "гАльма"],
    ["Глядач", "гладАч"],
    ["Горошина", "горошИна"],
    ["Граблі", "граблІ"],
    ["Гуртожиток", "гуртОжиток"],
    ["Данина", "данИна"],
    ["Дано", "дАно"],
    ["Дециметр", "децимЕтр"],
    ["Дещиця", "дЕщиця"],
    ["Де-юре", "де-Юре"],
    ["Джерело", "джерелО"],
    ["Дивлячись", "дИвлячись"],
    ["Дичавіти", "дичАвіти"],
    ["Діалог", "діалОг"],
    ["Добовий", "добовИй"],
    ["Добуток", "добУток"],
    ["Довезти", "довезтИ"],
    ["Довести", "довестИ"],
    ["Довідник", "довІдник"],
    ["Догмат", "дОгмат"],
    ["Довести", "довестИ"],
    ["Донька", "дОнька"],
    ["Дочка", "дочкА"],
    ["Дрова", "дрОва"],
    ["Експерт", "експЕрт"],
    ["Єретик", "єретИк"],
    ["Жалюзі", "жалюзІ"],
    ["Завдання", "завдАння"],
    ["Завезти", "завезтИ"],
    ["Завести", "завестИ"],
    ["Завжди", "зАвжди"],
    ["Завчасу", "завчасУ"],
    ["Загадка", "зАгадка"],
    ["Заіржавілий", "заіржАвілий"],
    ["Заіржавіти", "заіржАвіти"],
    ["Закінчити", "закінчИти"],
    ["Закладка (у книзі)", "зАкладка"],
    ["Закрутка", "зАкрутка"],
    ["Залишити", "залишИти"],
    ["Заміжня", "замІжня"],
    ["Занести", "занестИ"],
    ["Залонка", "зАлонка"],
    ["Заробіток", "заробІток"],
    ["Застава", "зАстава"],
    ["Застібка", "зАстібка"],
    ["Застопорити", "застОпорити"],
    ["Звисока", "звИсока"],
    ["Здалека", "здАлека"],
    ["Зібрання", "зібрАння"],
    ["Зобразити", "зобразИти"],
    ["Зозла", "зОзла"],
    ["Зрання", "зрАння"],
    ["Зручний", "зрУчний"],
    ["Зубожжіння", "зубОжіння"],
    ["Індустрія", "індУстрія"],
    ["Камбала", "кАмбала"],
    ["Каталог", "каталОг"],
    ["Квартал", "квартАл"],
    ["Кишка", "кИшка"],
    ["Кілометр", "кіломЕтр"],
    ["Кінчити", "кінчИти"],
    ["Колесо", "кОлесо"],
    ["Колія", "кОлія"],
    ["Кончений (дієприкметник)", "кОпчений"],
    ["Копчений (прикметник)", "копчЕний"],
    ["Корисний", "корИсний"],
    ["Косий", "кОсий"],
    ["Котрий", "котрИй"],
    ["Крицевий", "крицЕвий"],
    ["Кроїти", "крОїти"],
    ["Кропива", "кропивА"],
    ["Кулінарія", "кулінАрія"],
    ["Курятина", "кУрятина"],
    ["Лате", "лАте"],
    ["Листопад", "листопАд"],
    ["Літопис", "літОпис"],
    ["Люстро", "лЮстро"],
    ["Мабуть", "мАбУть"],
    ["Магістерський", "магістЕрський"],
    ["Маркетинг", "мАркетинг"],
    ["Мережа", "мерЕжа"],
    ["Металургія", "металУргія"],
    ["Міліметр", "мілімЕтр"],
    ["Навчання", "навчАння"],
    ["Нанести", "нанестИ"],
    ["Напій", "напІй"],
    ["Наскрізний", "нАскрізний"],
    ["Начинка", "нАчинка"],
    ["Ненавидіти", "ненАвидіти"],
    ["Ненависний", "ненАвисний"],
    ["Ненависть", "ненАвисть"],
    ["Нести", "нестИ"],
    ["Ніздря", "нІздря"],
    ["Новий", "новИй"],
    ["Обіцянка", "обіцЯнка"],
    ["Обрання", "обрАння"],
    ["Обруч (іменник)", "обрУч"],
    ["Одинадцять", "одинАдцять"],
    ["Одноразовий", "одноразОвий"],
    ["Ознака", "ознАка"],
    ["Ознака", "ознАка"],
    ["Олень", "Олень"],
    ["Оптовий", "оптОвий"],
    ["Осетер", "осетЕр"],
    ["Отаман", "отАман"],
    ["Оцет", "Оцет"],
    ["Павич", "павИч"],
    ["Партер", "партЕр"],
    ["Пекарський", "пЕкарський"],
    ["Перевезти", "перевезтИ"],
    ["Перевести", "перевестИ"],
    ["Перекис", "перЕкис"],
    ["Піала", "піалА"],
    ["Підданий (дієприкметник)", "пІдданий"],
    ["Підданий (іменник, істота)", "піддАний"],
    ["Підлітковий", "пІдлітковий"],
    ["Пізнання", "пізнАння"],
    ["Пітний", "пітнИй"],
    ["Піцерія", "піцЕрія"],
    ["Подруга", "пОдруга"],
    ["Позначка", "пОзначка"],
    ["Помилка", "пОмилка"],
    ["Поміщик", "помІщик"],
    ["Помовчати", "помОвчати"],
    ["Поняття", "понЯття"],
    ["Порядковий", "порядкОвий"],
    ["Посередені", "посерЕдені"],
    ["Привезти", "привезтИ"],
    ["Привести", "привестИ"],
    ["Приморозок", "прИморозок"],
    ["Принести", "принестИ"],
    ["Причіп", "прИчіп"],
    ["Проділ", "прОділ"],
    ["Проміжок", "промІжок"],
    ["Псевдонім", "псевдонІм"],
    ["Разом", "рАзом"],
    ["Ремінь (пояс)", "рЕмінь"],
    ["Решето", "рЕшето"],
    ["Ринковий", "рИнковий"],
    ["Рівнина", "рівнИна"],
    ["Роздрібний", "роздрібнИй"],
    ["Розпірка", "рОзпірка"],
    ["Рукопис", "рукОпис"],
    ["Русло", "руслО"],
    ["Сантиметр", "сантимЕтр"],
    ["Свердло", "свЕрдло"],
    ["Середина", "серЕдина"],
    ["Сеча", "сЕча"],
    ["Симетрія", "симетрІя"],
    ["Сільскогосподарський", "сільскогосподАрський"],
    ["Сімдесят", "сімдесЯт"],
    ["Слина", "слИна"],
    ["Соломинка", "соломИнка"],
    ["Статуя", "стАтуя"],
    ["Стовідсотковий", "стовідсОтковий"],
    ["Стрибати", "стрибАти"],
    ["Текстовий", "текстовИй"],
    ["Течія", "течіЯ"],
    ["Тисовий", "тисОвий"],
    ["Тім'яний", "тім'янИй"],
    ["Травестія", "травестІя"],
    ["Тризуб", "тризУб"],
    ["Тулуб", "тУлуб"],
    ["Український", "украЇнський"],
    ["Уподобання", "уподОбання"],
    ["Урочистий", "урочИстий"],
    ["Усередені", "усерЕдині"],
    ["Фартух", "фартУх"],
    ["Фаховий", "фаховИй"],
    ["Феномен", "фенОмен"],
    ["Фольга", "фОльга"],
    ["Форзац", "фОрзац"],
    ["Хаос (у міфології; стихія)", "хАос"],
    ["Хаос (безлад)", "хаОс"],
    ["Царина", "цАрина"],
    ["Цемент", "цемЕнт"],
    ["Центнер", "цЕнтнер"],
    ["Цінник", "ціннИк"],
    ["Чарівний", "чарівнИй"],
    ["Черговий", "черговИй"],
    ["Читання", "читАння"],
    ["Чорнозем", "чорнОзем"],
    ["Чорнослив", "чорнОслив"],
    ["Чотирнадцять", "чотирнАдцять"],
    ["Шляхопровід", "шляхопровІд"],
    ["Шовковий", "шовкОвий"],
    ["Шофер", "шофЕр"],
    ["Щелепа", "щЕлепа"],
    ["Щипці", "щИпці"],
    ["Щодобовий", "щодобовИй"],
    ["Ярмарковий", "ярмаркОвий"]
];
const initData = () => {
    currentWordIndex = 0;
    positiveCounter = 0;
    negativeCounter = 0;
    answer.innerHTML = '';
    positive.innerHTML = positiveCounter
    negative.innerHTML= negativeCounter
}


const getCurrentWordArr = () => words[currentWordIndex]

// must be once done before loading page
const generateWord = () => {
    currentWordIndex = Math.floor(Math.random() * words.length);
    
    wordElem = getCurrentWordArr()[0];
    word.innerHTML = wordElem
}

const onButtonClick = () => {
    const userInput = input.value;

    if(userInput.length > 0){
        if (userInput !== getCurrentWordArr()[1]) {
            // replace alert on html element. E.g. <div> Неправильно. Правильный... </div>
            answer.innerHTML = `<span style="color: #FF7878">Неправильно. Правильный ответ: ${getCurrentWordArr()[1]}. Ваш ответ: ${userInput}<span/>`
            input.value = null
            negativeCounter++;
            negative.innerHTML= negativeCounter
        } else {
            // replace alert on html element. E.g. <div> Правильно! </div>
            answer.innerHTML = `<span style="color: #9BFF99">Правильно!<span/>`

            positiveCounter++;
            positive.innerHTML = positiveCounter
            input.value = null
            words.splice(currentWordIndex, 1);
        }
        generateWord();
    }
}


const onRestartButton = () => { initData(); }

const keyPress = event => {
    if(event.keyCode === 13){
        onButtonClick()
    }
}

input.addEventListener('focus', () => {
    answer.innerHTML = ""
})
positive.innerHTML = positiveCounter
negative.innerHTML= negativeCounter
button.addEventListener('click', () => onButtonClick())
refreshButton.addEventListener('click',() => onRestartButton())
document.onload(generateWord())
